biddr_api/app/controllers/api/v1/sessions_controller.rb

    def create
        user = User.find_by_email params[:email]
---
SELECT "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT $1  [["LIMIT", 1]]